In [ ]:
import numpy as np
import pandas as pd

In [ ]:
filas = list('XYZ')
filas

In [ ]:
columnas = list('ABCDE')
columnas

In [ ]:
data = np.round(np.random.randn(3,5), 2)
data

In [ ]:
df = pd.DataFrame(data, filas, columnas)
df

In [ ]:
df['A']

In [ ]:
df['E']

In [ ]:
df[['B', 'D']]

In [ ]:
df

In [ ]:
df['C']['Y']

In [ ]:
llaves = list(range(1,10))
valores = list('ABCDEFGHI')
dicc = dict(zip(llaves, valores))
dicc

In [ ]:
pd.Series(dicc)

In [15]:
df

      A     B     C     D     E
X -0.95  1.39 -0.76  1.04 -0.11
Y  0.24  0.72 -2.52 -0.05 -0.30
Z -0.04 -0.62 -0.63 -2.25 -0.14

In [17]:
df['A+B'] = df['A'] + df['B']
df

      A     B     C     D     E   A+B
X -0.95  1.39 -0.76  1.04 -0.11  0.44
Y  0.24  0.72 -2.52 -0.05 -0.30  0.96
Z -0.04 -0.62 -0.63 -2.25 -0.14 -0.66

In [20]:
df.drop('A+B', axis=1, inplace=True)

In [21]:
df

      A     B     C     D     E
X -0.95  1.39 -0.76  1.04 -0.11
Y  0.24  0.72 -2.52 -0.05 -0.30
Z -0.04 -0.62 -0.63 -2.25 -0.14

In [22]:
df['A+B'] = df['A'] + df['B']
df

      A     B     C     D     E   A+B
X -0.95  1.39 -0.76  1.04 -0.11  0.44
Y  0.24  0.72 -2.52 -0.05 -0.30  0.96
Z -0.04 -0.62 -0.63 -2.25 -0.14 -0.66

In [23]:
df = df.drop('A+B', axis=1)

In [24]:
df

      A     B     C     D     E
X -0.95  1.39 -0.76  1.04 -0.11
Y  0.24  0.72 -2.52 -0.05 -0.30
Z -0.04 -0.62 -0.63 -2.25 -0.14

In [25]:
df.drop('Z')

      A     B     C     D     E
X -0.95  1.39 -0.76  1.04 -0.11
Y  0.24  0.72 -2.52 -0.05 -0.30

In [26]:
df.loc['X']

A   -0.95
B    1.39
C   -0.76
D    1.04
E   -0.11
Name: X, dtype: float64

In [27]:
df.iloc[0]

A   -0.95
B    1.39
C   -0.76
D    1.04
E   -0.11
Name: X, dtype: float64

In [28]:
df

      A     B     C     D     E
X -0.95  1.39 -0.76  1.04 -0.11
Y  0.24  0.72 -2.52 -0.05 -0.30
Z -0.04 -0.62 -0.63 -2.25 -0.14

In [29]:
df.shape

(3, 5)

In [31]:
df[['A', 'B']].loc[['X', 'Y']]

      A     B
X -0.95  1.39
Y  0.24  0.72

In [32]:
df

      A     B     C     D     E
X -0.95  1.39 -0.76  1.04 -0.11
Y  0.24  0.72 -2.52 -0.05 -0.30
Z -0.04 -0.62 -0.63 -2.25 -0.14

In [33]:
df < 0.5

      A      B     C      D     E
X  True  False  True  False  True
Y  True  False  True   True  True
Z  True   True  True   True  True

In [37]:
df['B'] < 0.5

X    False
Y    False
Z     True
Name: B, dtype: bool

In [38]:
df[df['B']< 0.5]

      A     B     C     D     E
Z -0.04 -0.62 -0.63 -2.25 -0.14

In [39]:
df

      A     B     C     D     E
X -0.95  1.39 -0.76  1.04 -0.11
Y  0.24  0.72 -2.52 -0.05 -0.30
Z -0.04 -0.62 -0.63 -2.25 -0.14

In [40]:
df.set_index('A')

          B     C     D     E
A
-0.95  1.39 -0.76  1.04 -0.11
 0.24  0.72 -2.52 -0.05 -0.30
-0.04 -0.62 -0.63 -2.25 -0.14

In [41]:
df

      A     B     C     D     E
X -0.95  1.39 -0.76  1.04 -0.11
Y  0.24  0.72 -2.52 -0.05 -0.30
Z -0.04 -0.62 -0.63 -2.25 -0.14

In [42]:
df.columns = [1,2,3,4,5]
df

      1     2     3     4     5
X -0.95  1.39 -0.76  1.04 -0.11
Y  0.24  0.72 -2.52 -0.05 -0.30
Z -0.04 -0.62 -0.63 -2.25 -0.14

In [43]:
df = pd.DataFrame(np.array([[1 ,5, 1], [1, np.nan, 2], [np.nan, np.nan, 3]]))
df.columns = ['A', 'B', 'C']
df

     A    B    C
0  1.0  5.0  1.0
1  1.0  NaN  2.0
2  NaN  NaN  3.0

In [47]:
df.dropna()

     A    B    C
0  1.0  5.0  1.0

In [48]:
df.dropna(axis=1)

     C
0  1.0
1  2.0
2  3.0

In [49]:
df

     A    B    C
0  1.0  5.0  1.0
1  1.0  NaN  2.0
2  NaN  NaN  3.0

In [52]:
df.fillna(0)

     A    B    C
0  1.0  5.0  1.0
1  1.0  0.0  2.0
2  0.0  0.0  3.0

In [53]:
df = pd.DataFrame(
    [
        ['Andres', 'Google', 200],
        ['Carlos', 'Google', 120],
        ['Juan', 'Facebook', 125],
        ['Cindy', 'Facebook', 250],
        ['Laura', 'Instagram', 120],
        ['Diego', 'Instagram', 500],

    ]
)
df

        0          1    2
0  Andres     Google  200
1  Carlos     Google  120
2    Juan   Facebook  125
3   Cindy   Facebook  250
4   Laura  Instagram  120
5   Diego  Instagram  500

In [56]:
df.columns = ['Nombre', 'Empresa', 'Ingresos']
df

   Nombre    Empresa  Ingresos
0  Andres     Google       200
1  Carlos     Google       120
2    Juan   Facebook       125
3   Cindy   Facebook       250
4   Laura  Instagram       120
5   Diego  Instagram       500

In [57]:
df.groupby('Empresa')

In [58]:
df.groupby('Empresa').mean()

           Ingresos
Empresa
Facebook      187.5
Google        160.0
Instagram     310.0

In [59]:
df.groupby('Empresa').sum()

           Ingresos
Empresa
Facebook        375
Google          320
Instagram       620

In [61]:
df.groupby('Empresa').std()

             Ingresos
Empresa
Facebook    88.388348
Google      56.568542
Instagram  268.700577

In [62]:
df.groupby('Empresa').count()

           Nombre  Ingresos
Empresa
Facebook        2         2
Google          2         2
Instagram       2         2

In [64]:
df.groupby('Empresa').max()

           Nombre  Ingresos
Empresa
Facebook     Juan       250
Google     Carlos       200
Instagram   Laura       500

In [65]:
df.groupby('Empresa').min()

           Nombre  Ingresos
Empresa
Facebook    Cindy       125
Google     Andres       120
Instagram   Diego       120